app/controllers/api/orders_controller.rb

SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 AND "wallets"."coin_id" = $2 LIMIT $3  [["user_id", 7], ["coin_id", "ethereum"], ["LIMIT", 1]]
UPDATE "wallets" SET "quantity" = $1, "updated_at" = $2 WHERE "wallets"."id" = $3  [["quantity", "97074.35"], ["updated_at", "2020-12-14 19:42:51.735137"], ["id", 89]]
INSERT INTO "orders" ("wallet_id", "coin_id", "quantity", "price", "transaction_type", "created_at", "updated_at", "total_value") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        # debugger


        user_wallet = Wallet.find_wallet(order_params[:user_id], order_params[:coin_id])
        user_usd_wallet = Wallet.find_wallet(order_params[:user_id], "usd")

        if order_params[:type] == "BUY"
            if order_params[:total_value].to_f > user_usd_wallet.quantity
                render json: ['Not enough USD to make purchase'], status: 422
            elsif order_params[:quantity].to_f == 0
                    render json: ["You can't have an order of $0, silly"], status: 422

            elsif !logged_in? || (current_user.id != order_params[:user_id].to_i)
                    render json: ['Invalid params'], status: 422

            else
                user_usd_wallet.update_quantity(order_params[:total_value].to_f * -1)
                user_wallet.update_quantity(order_params[:quantity].to_f)

                @order = Order.new(
                    wallet_id: user_wallet.id,
                    # user_id: order_params[:user_id],
                    coin_id: order_params[:coin_id],
                    quantity: order_params[:quantity].to_f,
                    price: order_params[:price].to_f,
                    total_value: order_params[:total_value].to_f,
                    transaction_type: 'BUY'
                )

                @order.save!