app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)
    # @user.cash_balance = 100000.00
    if @user.save
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at", "cash_balance") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"