app/views/api/users/_user.json.jbuilder

json.wallets do
    user.wallets.each do |wallet|
---
SELECT "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1  [["user_id", 7]]

            json.orders do
                json.array! wallet.orders do |order|
---
SELECT "orders".* FROM "orders" WHERE "orders"."wallet_id" = $1  [["wallet_id", 89]]