app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "niko2"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email.downcase)

INSERT INTO "wallets" ("coin_id", "user_id", "quantity", "wallet_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---

        supported_coins.each do |coin_id|
            if coin_id == "usd"
                Wallet.create(
                    :coin_id => coin_id,
                    :quantity => 100000,
                    :user_id => self.id,
                    :wallet_address => SecureRandom.hex(16))
            else
                Wallet.create(
                    :coin_id => coin_id,
                    :quantity => 0,
                    :user_id => self.id,
                    :wallet_address => SecureRandom.hex(16))