app/models/wallet.rb

	def self.find_wallet(user_id, coin_id)
        wallet = Wallet.find_by(user_id: user_id, coin_id: coin_id)
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."user_id" = $1 AND "wallets"."coin_id" = $2 LIMIT $3  [["user_id", 7], ["coin_id", "ethereum"], ["LIMIT", 1]]